// pages/park/park.js
Page({
  data: {
    list: [
      {
        image: '../../images/thumb.jpg',
        title: '易络客党支部4月党课',
        time: '2021-4-2',
        day: '周五',
        site: '易络客党支部大会议室',
        member: [
          {
            name: '吴子豪',
            sign: 1
          },
          {
            name: '范新华',
            sign: 1
          }
        ],
        index: 0,
        filename: 3,
        comment: [
          '此次学习我的感受如下：',
          '一、党员干部要加强学习，提高理论素质',
          '坚持领导班子及党员干部队伍的纯洁性，党员干部必须首先加强政治理论等方面的学习。不学习，政治上就不可能成熟，就不可能自觉改造自我的主观世界。仅有认真学习，真正具备马克思主义、毛泽东思想、邓小平理论和三个代表重要思想理论素养，坚定共产主义梦想，努力实现全面小康社会，才能够立足当前、放眼未来，增强履行历史职责的自觉性，坚定正确地贯彻执行党的基本路线，方能全心全意为人民群众服务。廉洁奉公，勤政为民，不说空话，多干实事，方能顾全大局，带领人民群众共同致富，才能够在错综复杂的环境中把握方向，解决矛盾，应对自如，经受住任何考验。不学习新的知识，就要落伍。仅有扎扎实实坚持学习，才能不断地得到提高。',
          '二、党员干部坚定信念，讲正气',
          '党员干部要坚持共产党人的高尚情操与革命气节，一个革命政党，必须有一股浩然正气，这样才能具有强大的精神支柱，才能充满生机与活力。党员干部要继承和发扬中华民族的优良文化和传统美德，要在马克思主义的基础上，培养和弘扬高尚的人格品质，坚持革命气节，要做到在任何情景下，都忠诚于党和人民的事业，不改变革命的初衷，不丧失必胜的信心，不怕困难，不信邪，坚持真理，维护党的原则，旗帜鲜明地同各种错误思想、不良倾向和邪恶势力作斗争，坚持廉洁奉公，艰苦奋斗，在拜金主义、享乐主义、个人主义和酒绿灯红的侵蚀影响面前一尘不染，正气凛然，在实践中不断坚定自我的信念、信仰、志向，锤炼自我的意志品质，真正塑造共产党人的高风亮节。',
          '三、党员干部讲民主，发挥团体智慧',
          '党员干部要坚持民主集中制的原则，遇事要多商量，多沟通，互相帮忙，互相扶持，听取群众的意见，充分发扬民主，让大家讲话，不搞家长制。增强党性，从大局出发，维护党支部和领导班子的团结，敢于坚持原则，对存在的问题，勇于发表意见，不搞奉承迎合。党员干部在坚持民主集中制方面起表率作用，既善于充分发扬民主，又善于实行正确的集中，养成经常开展批评与自我批评，自觉理解组织和群众监督的好习惯。党员干部在党的基本理论和基本路线的基础上，紧密团结在党中央周围，自觉维护党的团结统一和政治上的高度一致，把党的思想政治优势充分发挥出来。',
          '四、党员干部勇于开拓进取',
          '坚持实事求是，求真务实的思想路线，进取探索，大胆实践，认真研究新情景，解决新问题，认真贯彻党的路线、方针、政策和决议，解放思想、实事求是、求真务实。按照这条路线办事，我们的工作就会顺利开展，偏离这条路线，我们的工作就要受挫折。新世纪新形势，应对中国发展的良好机遇，应对前进道路上的新情景、新问题，党员干部必须解放思想、实事求是、求真务实。',
          '五、党员干部是作风优良，群众信任的表率',
          '我们共产党人来自人民，植根于人民、服务于人民，建设中国特色社会主义，实现全面小康社会，全部工作的出发点和落脚点就是全心全意为人民服务，党员干部应走群众路线，关心群众疾苦，全心全意为人民服务，办事公正、公开、公平，坚持同人民群众的血肉联系。党员干部坚持全心全意为人民服务的宗旨，一个核心问题就是为人民掌好权、用好权，是用权为民，还是以权谋私，是对党员干部的严峻考验，因而要树立正确的权力观。'
        ]
      },
      {
        image: '../../images/thumb.jpg',
        title: '易络客党支部党史学习教育',
        time: '2021-3-19',
        day: '周五',
        site: '易络客党支部大会议室',
        member: [
          {
            name: '陈诗悦',
            sign: 1
          },
          {
            name: '姜珊',
            sign: 1
          },
        ],
        index: 1,
        filename: 4,
        comment: [
          '一个合格的共产党员，应当始终坚持党和人民的利益高于一切，任何时候任何情景下都要做到个人利益服从党和人民的利益，吃苦在前，享受在后，多做贡献。没有什么事业能够易如反掌、一帆风顺。成就任何事业，都需要克服艰难险阻。对于共产党人来说，就不能贪图安逸和享受，要敢于迎难而上，敢于啃硬骨头。',
          '党员要像党员的样貌，是党员做合格党员必备的条件。作为一名党员，要坚定梦想信念，提高党性觉悟；增强政治意识、大局意识、核心意识、看齐意识，坚定正确政治方向；树立风清气正，严守政治纪律和政治规矩；进一步强化宗旨观念，勇于担当作为，在工作、学习和社会生活中起先锋模范作用。',
          '要讲求“进行时”。“两学一做”是继续巩固和扩大“三严三实”专题教育的活动成果，是结合当地的实际，着力构建的一种长效机制，不断推动“两学一做”是当前学习教育的“必修课”。当下，一些干部把学党章党规、学系列讲话，做合格党员当成“一阵风”，敷衍了事，甚至手里嘴里念着党章党规，心里却在盘算着如何快速为“两学一做”活动画上句号，这不仅仅达不到“两学一做”教育是目的，还极大拖累了“两学一做”的落实成效。所以，“两学一做”不仅仅应当成为改善领导干部观念淡薄，工作消极的重要手段，更应作为当下一切工作的考核标准，不仅仅落实在教育活动中，更体此刻实际工作中。',
          '要讲求“过去时”。当一些领导干部手里拿到《关于在全体党员中开展“学党章党规、学系列讲话，做合格党员”学习教育方案》时，心里就念起嘀咕，学党章党规、学系列讲话，我们过去不是都在学吗？何必又提呢？的确，我们每个领导干部都要经历党章党规的熏陶，在入党前要背背党章党规，在宣誓时，手里要拿着，心里要念着党章党规，还有每次中央领导的重大系列讲话，也组织大家参与学习讨论，能够说还是做到位了。可是，反问一下，形式做到位了，又有多少领导干部在心里到位了呢？回望过去，有多少领导干部落马？又有多少党员被撤职？这些难道还不足以给我们敲响警钟？孔子曰：温故而知新，能够为师矣，“两学一做”曰：温故而知新，能够为好党员矣。',
          '要讲求“将来时”。开展“两学一做”专题教育，不能仅仅当做一次“阶段性”活动，而应追求其价值的最大化，“学”要带着问题学，“做”要针对问题改，仅有学好了，改好了，才能为将来的工作奠定良好的基础，万丈高楼平地起，党风政风建设亦如此。所以要把“两学一做”学到脑，学到心，保长效。要想“两学一做”学好做好，就必须坚持联系实际，从自身找问题，也要大胆找出别人的问题，坚决防止形式主义、走过场。让“两学一做”作为干部清正廉洁、为民服务的方向标，永远朝此方向前进，就不用担心走歪路，走邪路，让党员干部永葆清正廉洁、一心为民的精神面貌。'
        ]
      },
      {
        image: '../../images/thumb.jpg',
        title: '易络客党支部3月党课',
        time: '2021-3-5',
        day: '周五',
        site: '易络客党支部大会议室',
        member: [
          {
            name: '李洁',
            sign: 0
          },
          {
            name: '蒋政育',
            sign: 1
          }
        ],
        index: 1,
        filename: 8,
        comment: [
          '党员是一张名片，是荣誉、更是职责，并且职责远比荣誉大。',
          '一名合格的共产党员必须要有职责心。职责是一种压力，职责是一种操守，职责更是一种动力。一个有职责心的共产党员，首先要勇于担当职责，就是要对人民群众负责，对党的事业负责，对组织工作负责。基层党员的职责在于爱岗敬业，扎扎实实地工作，是对工作高度的负职责，努力将工作落到实处的进取精神。“职责重于泰山”“职责心决定质量”，这些都充分说明了职责对于我们工作的重要意义。',
          '一名合格的共产党员必须要有诚信之心。我们的党是一个诚信的党，是代表先进生产力的发展要求，代表先进文化的前进方向，代表最广大人民的根本利益的政党。仅有我们的诚信才能赢得最广大人民群众的支持，更好地服务于人民，服务于社会。讲诚信就要做到表里如一，取信于人的前提是心地坦诚，仅有内诚于心，才能外信于人;讲诚信，就要自觉坚持实事求是，追求真理;讲诚信，就要坚持言行一致，说到做到，说话办事重实际、求实效。作为一个员工，对企业的忠诚，对岗位的热爱，热爱自我的企业，珍惜自我的工作岗位是诚信的基础。在工作中要顾全大局，处处维护团体的利益，不做任何有损团体利益的事。',
          '一名合格的共产党员对我们党的事业要有自信之心。自信是共产党人的品格，这种自信源自于我们党对梦想信念的矢志追求和对现实实践的科学评估。共产党人因为充满了信仰和自信，由弱到强，历经艰难险阻，最终取得了新民主主义革命的胜利;共产党人因为充满了信仰和自信，在艰难时期创造了“两弹一星”，在社会主义建设时期，共产党人带领人民在信仰的旗帜下，书写了一个又一个传奇。无论搞革命、搞建设、搞改革，道路问题是最根本的问题，只要沿着中国特色社会主义这条康庄大道昂首阔步地向前走，始终充满道路自信、理论自信、制度自信，就能最终到达成功的彼岸。我们的信心源自于我们的实力，在中国共产党的领导下，我们伟大的民族复兴之梦必须能够实现!'
        ]
      },
      {
        image: '../../images/thumb.jpg',
        title: '易络客党支部2月党课',
        time: '2021-2-5',
        day: '周五',
        site: '易络客党支部大会议室',
        member: [
          {
            name: '王道建',
            sign: 1
          },
          {
            name: '于立春',
            sign: 1
          },
        ],
        index: 0,
        filename: 2,
        comment: [
          '党是一座灯塔，党是一座丰碑。党员意识是党员对党的职责心，是一个党员称职与否的基础。党员意识在必须程度上就是职责意识。有了职责意识，就能集中精力，全身心投入，构成意志和品格；有了职责意识，就能凝聚人心，凝聚力量，创造出第一流的业绩。',
          '党员要牢记“我是有组织的人”。党员对党的事业始终充满使命感和自信心，有目标，有活力，有韧劲，以自我忠实的工作让党的指示和精神落地生根、开花结果。要吃苦在前，享乐在后，永不懈怠，把自我有限的生命投入到无限的为人民服务之中去。',
          '党员要传播“正能量”，牢记“一个党员就是一面旗帜”。旗帜，代表着方向，展示着形象，体现着力量。是方向，就要讲真理、讲真相、讲事实、讲原则，牺牲自我，点亮别人，用光明驱散黑暗，用真善美战胜假恶丑。是形象，就要有一股信仰坚定、意志坚强、品行坚贞、担当奉献的“精、气、神”，能用自身的强大“气场”来团结、影响和带领周围群众。是力量，就要让群众觉得有了共产党员就有了盼头、有了劲头、有了期望！',
          '党员要当“实干家”，牢记“全心全意为人民服务的宗旨”。党员作为一名有共产主义觉悟的先锋战士，无论担任何种职务、从事何种工作都要视责如山，守责如城，履责如冰，当好“急先锋”，做好“顶梁柱”，搭好“唱戏台”，对党的事业始终充满使命感和自信心，有目标，有活力，有韧劲，以自我忠实的工作让党的指示和精神落地生根、开花结果。要吃苦在前，享乐在后，永不懈怠，把自我有限的生命投入到无限的为人民服务之中去，从身边一点一滴的小事做起，真抓实干，狠抓落实，为实现党和人民的根本利益而奋不顾身地去拼搏、去奋斗乃至献出生命！',
          '党员要做“清白人”，牢记“铁的纪律和严的规矩”。作为共产党员要做到“富贵不能淫、贫贱不能移、威武不能屈”、“不为五斗米折腰”，要有“宁折不弯”的品格、“近墨不黑”的意志，经得起“糖衣炮弹”的袭击，不为小义而违大道，清白做人，干净做事，勤俭生活。把纪律和规矩时刻放在心上，服从组织，严守纪律，为实现一个地方、一个单位的发展和身边百姓的安康而鞠躬尽瘁。'
        ]
      },
      {
        image: '../../images/thumb.jpg',
        title: '易络客党支部1月党课',
        time: '2021-1-8',
        day: '周五',
        site: '易络客党支部大会议室',
        member: [
          {
            name: '吴子豪',
            sign: 0
          },
          {
            name: '陈诗悦',
            sign: 1
          },
          {
            name: '姜珊',
            sign: 1
          }
        ],
        index: 2,
        filename: 5,
        comment: [
          '党员要像个党员，就不能不尊崇党章，就不能没有为人民服务的宗旨意识，就不能不严守政治纪律和政治规矩。怎样才算是合格党员？能够用“四讲四有”来衡量；能够用党章来衡量；能够用党规党纪来衡量；能够用习近平总书记系列重要讲话精神来衡量；能够用群众的评价来衡量。',
          '一、思想上做与时俱进的模范',
          '认真学习党史和党章，了解我们党的光辉奋斗史，进一步学习马列主义、毛泽东思想、邓小平理论"三个代表"重要思想并深入学习实践科学发展观。讲党性、重品行、作表率，进取主动参加单位组织的各项党员活动，明确作为一名共产党员，必须把实现共产党的远大梦想与学习、工作的实际紧密结合起来。',
          '二、学习上刻苦努力见贤思齐',
          '坚持把学习作为自我完善和提高的重要途径，进取参加单位组织的各种学习，利用业余时间自我学习，不断夯实自我的理论水平，提高业务本事，在工作中不断改善，不断提高，朝一个优秀的干部，一个优秀的共产党员的目标不断前进。能够抱着学习的态度，虚心向各位领导和老同志请教，从工作中学习知识，用学到的知识来指导工作。针对自身的不足，时刻提示自我“怕什么就去做什么，不愿意什么就去做什么”，克服自我的惧怕和惰性心理。',
          '三、工作上认真做好本职工作',
          '我们组工干部作为“管党员的党员”其一言一行都会直接影响到党在群众心目中的威信和组织部门的形象，能够说每一个组工干部所肩负的职责都重于泰山，由不得我们存有一丝懈怠之心、半点侥幸心理，作为年轻组工干部必须立足本职，奋发进取，潜心学习，踏实工作、尽职尽责，以认真负责的态度对待每一项工作，认真研究上级文件精神，把党的方针政策贯彻到位，做到卓有成效地开展工作。要按时做好领导交办的各项工作，同时进取协助其他同志完成任务。'
        ]
      },
      {
        image: '../../images/thumb.jpg',
        title: '易络客党支部党史学习教育',
        time: '2020-12-18',
        day: '周五',
        site: '易络客党支部大会议室',
        member: [
          {
            name: '于立春',
            sign: 1
          },
          {
            name: '陈诗悦',
            sign: 1
          },
          {
            name: '范新华',
            sign: 1
          }
        ],
        index: 2,
        filename: 1,
        comment: [
          '在短短的几天培训中，我始终抱着认真的态度参加每一天的学习，听取教师的精彩报告，和党员互动交流学习。异常是金一南教授的讲座，让我受益匪浅。我深刻的了解到了必须领会学习型政党的深刻内涵和建设学习型政党的重要意义，并以高度负责的精神和认真的态度致力于学习型政党的建设。对于我们来说，学习是一种职责。我们生活工作在这个充满机遇和挑战的时代，许多新事物需要我们去学习、去探索、去实践，许多新问题有待我们去研究、去回答、去解决。学习又是一种追求。一个人的人生情趣，不仅仅是闲情逸致，更是一种文化品格；不仅仅是怡情养性，更是一种道德建树；不仅仅是个人情怀，更是一种人生境界。学习还是一种生活方式。',
          '当今世界，科学技术日新月异，知识经济方兴未艾，知识总量呈几何级数增长，知识更新速度大大加快，我们不懂、不熟悉的东西很多，即使过去懂的知识也在不断更新。在这个知识经济时代，学习已不是一个人一生中某一阶段的事，而是一种社会化、制度化和终生化的行为，是现代社会每个人成长提高的客观需要。不实现知识的不断更新，就必然落后于时代前进的步伐，甚至还可能被历史所抛弃，我们要时刻有“知识恐慌”和“本领缺失”的意识。我们不仅仅要从提高自身素质和岗位职责出发看待学习问题，并且要从社会职责和示范需要角度重视学习问题，既要做读书学习的自觉实践者，又要做学习型政党、学习型社会建设的进取倡导者、精心组织者、大力推动者。',
          '经过这次培训班学习，我们重温了许多党的基本理论知识，更加认识到仅有中国共产党能够救中国的道理。',
          '中国共产党在马克思列宁主义、毛泽东思想、邓小平理论和“三个代表”重要思想的指导下经历了九十多年的风风雨雨，在一次次挫折中吸取教训，在一次次胜利中不断成长，发展到此刻成为一个拥有数千万党员的执政党，并引领全国各族人民在建设有中国特色社会主义道路上不断的前进。回首中国共产党走过的路程，其间有许许多多的挫折与失败，但她取得的光辉业绩是举世瞩目的。这一切都是在思想的指导下产生的，“左倾”、“右倾”等错误的思想造成了第五次反围剿的失败、文化大革命等挫折，但在马列主义的指导下结合中国的特殊国情产生了毛泽东思想、邓小平理论和“三个代表”重要思想，在这些先进思想的指导下，中国的政治、经济、文化都取得了飞速的发展，并初步实现了全面建设小康社会的目标。可见，正确的先进的思想理论是我党不断前进的动力，是社会主义建设事业的助推器。'
        ]
      }
    ]
  },
  goback() {
    wx.navigateBack()
  },
  goToDetail(e) {
    const item = e.currentTarget.dataset.item
    wx.navigateTo({
      url: `/pages/parkDetail/parkDetail?data=${JSON.stringify(item)}`,
    })
  },
  onShareAppMessage: function () {

  }
})